content/main/20211108153719-general_task_doing_machine.md
+++
title = "General task doing machine"
author = ["System Administrator"]
draft = false
+++

strategy/principle and flows for doing task in a session


## Background Sound {#background-sound}


### Magic image {#magic-image}

Imagin the thing I'm learning is a kind of magic. Being able to understand and use the thing would give me the ability to perform magic.

Imagine the power. The power I could get from the knowledge, the power scene.


## Strategy/Principle {#strategy-principle}


### Take Log {#take-log}


#### Log or not {#log-or-not}

Could skip log only with tasks too simple/used to that I could resite  the whole process with ease

```python
if (taskEasy or taskSkilled):
    log.takelog = False
```


### Have Priority {#have-priority}

Do the important part first


### Have process control standard {#have-process-control-standard}

Where am I? How much left?
Have a simple process bar.


### Session time-small as possible {#session-time-small-as-possible}

My consciousness fades quickly. Keep the session small as possible, dedicated to only thing. A session with more than 1 goal make my consciousness fade even faster.

It depends on my body condition. If my condition allow, the session could be longer.

for now, `30 minutes` of a session is a taken standard


### No distraction {#no-distraction}

Distraction here means embracing the strategy and structure I see randomly the first sight.

BE LOYAL TO THE TASK AT HAND!!!


### Regular little exercise {#regular-little-exercise}

could use pormordo timer, 25m of sitting and 5m of exercise.
This time period, I know, don't fit me very well. Could find better.


### Focus {#focus}

Stay outsider, stay evaluating the deed.
Do so by lay focus on the back of head.


### Water rule {#water-rule}

Drink as more hot water as I could. Drink continuously.
The hot steam help too.

This make me calm, relax and mind to be open.


### Outline rule(doc) {#outline-rule--doc}

Always keep a outline of the work.
work is essentially building system. The outline of the system take the black box abstraction to enable higher thinking and memory.

This help `remember` and `understanding` the content and structure of the system. Even when I'm following a detailed instruction.

Ignorance of this leads to bunch of `vague code` which I don't know I wrote them nor what they are for.


### Background sound {#background-sound}


#### Genius of myself {#genius-of-myself}

I'm genius of myself and myself only
I create things, I'm legend, but only to myself. Personal victory, and there's nothing to compete with others.


#### Calm awareness {#calm-awareness}

Aware of all things I would be interacting during the session, and repect them, be thankful to them.
It's their precence make this session happen.


#### Prevent {#prevent}

Prevent bad things from happenning by organize and deal with the seeds in advance


## Flow {#flow}


### 1. Hot Water Cycle {#1-dot-hot-water-cycle}

Make sure to drink continuously in the process.
Every 30m, get up to refill the bottle. Exercise a little bit, maybe.


### 2. Check in the task {#2-dot-check-in-the-task}

When checking in the task,

1.  Make sure the focus is right
    on the back of brain
    calm, relax, especially the muscle around eye.(hot water helps)
2.  review the outline(or make one)
    make sure you know that where in the world are you, clearly.
    use Black Box abstraction.


### commented flow {#commented-flow}


## Submachines {#submachines}


### [Focus machine]({{< relref "20211114232712-focus_machine.md" >}}) {#focus-machine--20211114232712-focus-machine-dot-md}

When having difficulty focusing, could apply the machine
I'm usually focused. But might with inappropriate type of focus.


## Improvisation {#improvisation}

maybe a improvisation machine would be better.


### Flow {#flow}


#### Improvisation strategy check {#improvisation-strategy-check}

Check for strategy/principle always in improvisation


### Improvisation Strategy/principle {#improvisation-strategy-principle}


#### Inbox {#inbox}